# Задание 1:
# Поработайте с переменными,
# создайте несколько, выведите на экран,
# запросите у пользователя несколько чисел и строк
# и сохраните в переменные, выведите на экран.
my_var = 10
ans_var = my_var + 15
print('---> Мой ответ = ', ans_var)
print('Работа с переменными, Задание 1 часть 2')
user_name = input('---> Укажите ваше имя ')
user_age = int(input('---> Укажите ваш полный возраст использую цифры '))
print('Привет, ',user_name,', рад нашему знакомству с',2020-user_age,'года ;)')